Tekla Open API Reference for Tekla Structures 2025
Mark.MarkAttributes Class
 The MarkAttributes class defines the mark attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.MarkBase.MarkBaseAttributes
 Tekla.Structures.Drawing.Mark.MarkAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class MarkAttributes : MarkBase.MarkBaseAttributes
<SerializableAttribute>
Public Class MarkAttributes
	Inherits MarkBase.MarkBaseAttributes
The Mark.MarkAttributes type exposes the following members.
Constructors
Name | Description
Mark.MarkAttributes(ModelObject)
 Creates a new default mark attributes instance that loads standard attributes.
Mark.MarkAttributes(ModelObject, String)
 Creates a new mark attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Angle
 The actual angle of the mark, in degrees. Can differ from the rotation angle set by the user for marks, e.g. 45-degree column marks in GA drawings or when placing mark along part edges.
 (Inherited from MarkBase.MarkBaseAttributes.)
ArrowHead
 The arrowhead of the leader line(s).
 (Inherited from MarkBase.MarkBaseAttributes.)
Content
 The mark content as a list of elements.
CustomPresentation
 Custom presentation GUID to be applied to the object type
 (Inherited from MarkBase.MarkBaseAttributes.)
Frame
 The frame attributes of the mark's labels.
 (Inherited from MarkBase.MarkBaseAttributes.)
PlacingAttributes
 The placing attributes that the object should use. Using these you can specify whether the object is automatically arranged in the drawing or not.
 (Inherited from MarkBase.MarkBaseAttributes.)
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
 (Inherited from MarkBase.MarkBaseAttributes.)
RotationAngle
 The mark rotation angle set by the user. Unit is degrees.
 (Inherited from MarkBase.MarkBaseAttributes.)
TextAlignment
 The mark text alignment.
 (Inherited from MarkBase.MarkBaseAttributes.)
TransparentBackground
 The mark text background transparency. (transparent/opaque)
 (Inherited from MarkBase.MarkBaseAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace